"espk" = "Applen kaiutinportti";
"ispk" = "Sisäinen";
"emic" = "Mikrofoniportti";
"imic" = "Sisäinen";
"hdpn" = "Kuulokeportti";
"lini" = "Äänen linjatuloportti";
"lino" = "Äänen linjalähtöportti";
"spdi" = "Optinen digitaalisisäänmenoportti";
"spdo" = "Optinen digitaaliulostuloportti";
"pci " = "PCI-kortti";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Verkkolaite";
"blue" = "Bluetooth";
"bluh" = "Bluetooth-kuulokkeet";
"blus" = "Bluetooth-kuulokemikrofoni";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
